export const QNA = [
  {
    id: 0,
    title: '실수 줄이는 팁 있을까요?',
    questionType: 'DEVELOP',
    name: 'weekend',
    heart: 15,
    commentCount: 3,
    detailContent:
      '프론트엔드 취준생인데요 지금 알고리즘 프로그래머스 기준으로 2단계까지는 풀 수 있는데 코딩 테스트를 볼 때 테스트 케이스 모두 통과하고 제출하는데 항상 탈락해요.. 코딩 테스트는 풀 수만 있으면 된다고 들었는데 아닌가요? 게다가 테스트 케이스 만점이 탈락이라면 대체 어떻게 해야 합격인걸까요? 합격의 기준이 뭔지 모르겠습니다.. 혹시 코드 성능이 합불에 영향을 미치고 있다면 코테 보는 중에는 직접 측정할 수도 없는데 이 부분은 어떻게 스스로 개선해야할까요?',
  },
  {
    id: 1,
    title: '포트 폴리오 관련 질문 있습니다.',
    questionType: 'CONCERN',
    name: 'wave123',
    heart: 10,
    commentCount: 3,
    detailContent:
      '프론트엔드 취준생인데요 지금 알고리즘 프로그래머스 기준으로 2단계까지는 풀 수 있는데 코딩 테스트를 볼 때 테스트 케이스 모두 통과하고 제출하는데 항상 탈락해요.. 코딩 테스트는 풀 수만 있으면 된다고 들었는데 아닌가요? 게다가 테스트 케이스 만점이 탈락이라면 대체 어떻게 해야 합격인걸까요? 합격의 기준이 뭔지 모르겠습니다.. 혹시 코드 성능이 합불에 영향을 미치고 있다면 코테 보는 중에는 직접 측정할 수도 없는데 이 부분은 어떻게 스스로 개선해야할까요?',
  },
  {
    id: 2,
    title:
      '코딩테스트 계속 떨어지는데 이유를 모르겠어요 코딩테스트 계속 떨어지는데 이유를 모르겠어요',
    questionType: 'RECRUIT',
    name: 'snaghow',
    heart: 7,
    commentCount: 1,
    detailContent:
      '프론트엔드 취준생인데요 지금 알고리즘 프로그래머스 기준으로 2단계까지는 풀 수 있는데 코딩 테스트를 볼 때 테스트 케이스 모두 통과하고 제출하는데 항상 탈락해요.. 코딩 테스트는 풀 수만 있으면 된다고 들었는데 아닌가요? 게다가 테스트 케이스 만점이 탈락이라면 대체 어떻게 해야 합격인걸까요? 합격의 기준이 뭔지 모르겠습니다.. 혹시 코드 성능이 합불에 영향을 미치고 있다면 코테 보는 중에는 직접 측정할 수도 없는데 이 부분은 어떻게 스스로 개선해야할까요?',
  },
  {
    id: 3,
    title: '포트폴리오 관련 질문 있습니다',
    questionType: 'RECRUIT',
    name: 'lsj0202',
    heart: 2,
    commentCount: 2,
    detailContent:
      '프론트엔드 취준생인데요 지금 알고리즘 프로그래머스 기준으로 2단계까지는 풀 수 있는데 코딩 테스트를 볼 때 테스트 케이스 모두 통과하고 제출하는데 항상 탈락해요.. 코딩 테스트는 풀 수만 있으면 된다고 들었는데 아닌가요? 게다가 테스트 케이스 만점이 탈락이라면 대체 어떻게 해야 합격인걸까요? 합격의 기준이 뭔지 모르겠습니다.. 혹시 코드 성능이 합불에 영향을 미치고 있다면 코테 보는 중에는 직접 측정할 수도 없는데 이 부분은 어떻게 스스로 개선해야할까요?',
  },
  {
    id: 4,
    title: '코틀린으로 취직 되나요?',
    questionType: 'CONCERN',
    name: 'jwc5252',
    heart: 0,
    commentCount: 1,
    detailContent:
      '프론트엔드 취준생인데요 지금 알고리즘 프로그래머스 기준으로 2단계까지는 풀 수 있는데 코딩 테스트를 볼 때 테스트 케이스 모두 통과하고 제출하는데 항상 탈락해요.. 코딩 테스트는 풀 수만 있으면 된다고 들었는데 아닌가요? 게다가 테스트 케이스 만점이 탈락이라면 대체 어떻게 해야 합격인걸까요? 합격의 기준이 뭔지 모르겠습니다.. 혹시 코드 성능이 합불에 영향을 미치고 있다면 코테 보는 중에는 직접 측정할 수도 없는데 이 부분은 어떻게 스스로 개선해야할까요?',
  },
  {
    id: 5,
    title: '노드 못해도 취직 되나요?',
    questionType: 'CONCERN',
    name: 'ulh1212',
    heart: 0,
    commentCount: 3,
    detailContent:
      '프론트엔드 취준생인데요 지금 알고리즘 프로그래머스 기준으로 2단계까지는 풀 수 있는데 코딩 테스트를 볼 때 테스트 케이스 모두 통과하고 제출하는데 항상 탈락해요.. 코딩 테스트는 풀 수만 있으면 된다고 들었는데 아닌가요? 게다가 테스트 케이스 만점이 탈락이라면 대체 어떻게 해야 합격인걸까요? 합격의 기준이 뭔지 모르겠습니다.. 혹시 코드 성능이 합불에 영향을 미치고 있다면 코테 보는 중에는 직접 측정할 수도 없는데 이 부분은 어떻게 스스로 개선해야할까요?',
  },
  {
    id: 6,
    title: '노드 못해도 취직 되나요?',
    questionType: 'CONCERN',
    name: 'ulh1212',
    heart: 0,
    commentCount: 3,
    detailContent:
      '프론트엔드 취준생인데요 지금 알고리즘 프로그래머스 기준으로 2단계까지는 풀 수 있는데 코딩 테스트를 볼 때 테스트 케이스 모두 통과하고 제출하는데 항상 탈락해요.. 코딩 테스트는 풀 수만 있으면 된다고 들었는데 아닌가요? 게다가 테스트 케이스 만점이 탈락이라면 대체 어떻게 해야 합격인걸까요? 합격의 기준이 뭔지 모르겠습니다.. 혹시 코드 성능이 합불에 영향을 미치고 있다면 코테 보는 중에는 직접 측정할 수도 없는데 이 부분은 어떻게 스스로 개선해야할까요?',
  },
];

export const QNA_SORT = [
  {
    id: 0,
    title: '최신순',
  },
  {
    id: 1,
    title: '공감순',
  },
  {
    id: 2,
    title: '조회순',
  },
];

export const QNA_CATEGORY = [
  {
    id: 0,
    qnaType: 'ALL',
    qnaTitle: '전체',
    emoji: '🖥️',
  },
  {
    id: 1,
    qnaType: 'DEVELOP',
    qnaTitle: '개발',
    emoji: '💻',
  },
  {
    id: 2,
    qnaType: 'RECRUIT',
    qnaTitle: '취업',
    emoji: '👔',
  },
  {
    id: 3,
    qnaType: 'CONCERN',
    qnaTitle: '고민',
    emoji: '🤔',
  },
];

export const QNA_COMMENT = [
  {
    id: 0,
    contents:
      '안녕하세요! 저는 AI Tech Mentor입니다. 먼저 회사 선택은 매우 중요한 결정입니다.연봉이 많이 주지만 범위가 좁고 루틴한 업무를 맡게 될 경우, 일상의 일정과 책임이명확할 수 있지만 업무의 변화와 자유도는 제한적일 수 있습니다. 반면에 연봉은적을지라도 다양한 업무를 맡을 수 있는 회사에서는 업무의 다양성과 도전적인 경험을 얻을 수 있습니다.',
    createAt: '5',
    name: 'lsj0202',
  },
  {
    id: 1,
    contents:
      '안녕하세요! 저는 AI Tech Mentor입니다. 먼저 회사 선택은 매우 중요한 결정입니다.연봉이 많이 주지만 범위가 좁고 루틴한 업무를 맡게 될 경우, 일상의 일정과 책임이명확할 수 있지만 업무의 변화와 자유도는 제한적일 수 있습니다. 반면에 연봉은적을지라도 다양한 업무를 맡을 수 있는 회사에서는 업무의 다양성과 도전적인 경험을 얻을 수 있습니다.',
    createAt: '2',
    name: 'kth0303',
  },
];

export const QNA_WRITE_CATEGORY = [
  {
    id: 0,
    qnaType: 'DEVELOP',
  },
  {
    id: 1,
    qnaType: 'RECRUIT',
  },
  {
    id: 2,
    qnaType: 'CONCERN',
  },
];
