export const QNA_LIST = [
  {
    title: '실수 줄이는 팁 있을까요?',
    question_type: '개발',
    name: 'weekend',
    heart: 15,
    comment_count: 3,
    detail_content:
      '프론트엔드 취준생인데요 지금 알고리즘 프로그래머스 기준으로 2단계까지는 풀 수 있는데 코딩 테스트를 볼 때 테스트 케이스 모두 통과하고 제출하는데 항상 탈락해요.. 코딩 테스트는 풀 수만 있으면 된다고 들었는데 아닌가요? 게다가 테스트 케이스 만점이 탈락이라면 대체 어떻게 해야 합격인걸까요? 합격의 기준이 뭔지 모르겠습니다.. 혹시 코드 성능이 합불에 영향을 미치고 있다면 코테 보는 중에는 직접 측정할 수도 없는데 이 부분은 어떻게 스스로 개선해야할까요?',
  },
  {
    title: '포트 폴리오 관련 질문 있습니다.',
    question_type: '고민',
    name: 'wave123',
    heart: 10,
    comment_count: 3,
    detail_content:
      '프론트엔드 취준생인데요 지금 알고리즘 프로그래머스 기준으로 2단계까지는 풀 수 있는데 코딩 테스트를 볼 때 테스트 케이스 모두 통과하고 제출하는데 항상 탈락해요.. 코딩 테스트는 풀 수만 있으면 된다고 들었는데 아닌가요? 게다가 테스트 케이스 만점이 탈락이라면 대체 어떻게 해야 합격인걸까요? 합격의 기준이 뭔지 모르겠습니다.. 혹시 코드 성능이 합불에 영향을 미치고 있다면 코테 보는 중에는 직접 측정할 수도 없는데 이 부분은 어떻게 스스로 개선해야할까요?',
  },
  {
    title:
      '코딩테스트 계속 떨어지는데 이유를 모르겠어요 코딩테스트 계속 떨어지는데 이유를 모르겠어요',
    question_type: '취업',
    name: 'snaghow',
    heart: 7,
    comment_count: 1,
    detail_content:
      '프론트엔드 취준생인데요 지금 알고리즘 프로그래머스 기준으로 2단계까지는 풀 수 있는데 코딩 테스트를 볼 때 테스트 케이스 모두 통과하고 제출하는데 항상 탈락해요.. 코딩 테스트는 풀 수만 있으면 된다고 들었는데 아닌가요? 게다가 테스트 케이스 만점이 탈락이라면 대체 어떻게 해야 합격인걸까요? 합격의 기준이 뭔지 모르겠습니다.. 혹시 코드 성능이 합불에 영향을 미치고 있다면 코테 보는 중에는 직접 측정할 수도 없는데 이 부분은 어떻게 스스로 개선해야할까요?',
  },
  {
    title: '포트폴리오 관련 질문 있습니다',
    question_type: '취업',
    name: 'lsj0202',
    heart: 2,
    comment_count: 2,
    detail_content:
      '프론트엔드 취준생인데요 지금 알고리즘 프로그래머스 기준으로 2단계까지는 풀 수 있는데 코딩 테스트를 볼 때 테스트 케이스 모두 통과하고 제출하는데 항상 탈락해요.. 코딩 테스트는 풀 수만 있으면 된다고 들었는데 아닌가요? 게다가 테스트 케이스 만점이 탈락이라면 대체 어떻게 해야 합격인걸까요? 합격의 기준이 뭔지 모르겠습니다.. 혹시 코드 성능이 합불에 영향을 미치고 있다면 코테 보는 중에는 직접 측정할 수도 없는데 이 부분은 어떻게 스스로 개선해야할까요?',
  },
  {
    title: '코틀린으로 취직 되나요?',
    question_type: '고민',
    name: 'jwc5252',
    heart: 0,
    comment_count: 1,
    detail_content:
      '프론트엔드 취준생인데요 지금 알고리즘 프로그래머스 기준으로 2단계까지는 풀 수 있는데 코딩 테스트를 볼 때 테스트 케이스 모두 통과하고 제출하는데 항상 탈락해요.. 코딩 테스트는 풀 수만 있으면 된다고 들었는데 아닌가요? 게다가 테스트 케이스 만점이 탈락이라면 대체 어떻게 해야 합격인걸까요? 합격의 기준이 뭔지 모르겠습니다.. 혹시 코드 성능이 합불에 영향을 미치고 있다면 코테 보는 중에는 직접 측정할 수도 없는데 이 부분은 어떻게 스스로 개선해야할까요?',
  },
  {
    title: '노드 못해도 취직 되나요?',
    question_type: '고민',
    name: 'ulh1212',
    heart: 0,
    comment_count: 3,
    detail_content:
      '프론트엔드 취준생인데요 지금 알고리즘 프로그래머스 기준으로 2단계까지는 풀 수 있는데 코딩 테스트를 볼 때 테스트 케이스 모두 통과하고 제출하는데 항상 탈락해요.. 코딩 테스트는 풀 수만 있으면 된다고 들었는데 아닌가요? 게다가 테스트 케이스 만점이 탈락이라면 대체 어떻게 해야 합격인걸까요? 합격의 기준이 뭔지 모르겠습니다.. 혹시 코드 성능이 합불에 영향을 미치고 있다면 코테 보는 중에는 직접 측정할 수도 없는데 이 부분은 어떻게 스스로 개선해야할까요?',
  },
  {
    title: '노드 못해도 취직 되나요?',
    question_type: '고민',
    name: 'ulh1212',
    heart: 0,
    comment_count: 3,
    detail_content:
      '프론트엔드 취준생인데요 지금 알고리즘 프로그래머스 기준으로 2단계까지는 풀 수 있는데 코딩 테스트를 볼 때 테스트 케이스 모두 통과하고 제출하는데 항상 탈락해요.. 코딩 테스트는 풀 수만 있으면 된다고 들었는데 아닌가요? 게다가 테스트 케이스 만점이 탈락이라면 대체 어떻게 해야 합격인걸까요? 합격의 기준이 뭔지 모르겠습니다.. 혹시 코드 성능이 합불에 영향을 미치고 있다면 코테 보는 중에는 직접 측정할 수도 없는데 이 부분은 어떻게 스스로 개선해야할까요?',
  },
];
